experiments/workflow/beldi-movie/expected_results/qps150/wrk_warmup.log
Running 30s test @ http://ip-172-31-15-142.us-east-2.compute.internal:8080
  2 threads and 2 connections
  Thread calibration: mean lat.: 3.963ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.236ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.45ms    8.62ms  47.26ms   91.89%
    Req/Sec    78.32     67.92   500.00     67.51%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.05ms
 75.000%    1.29ms
 90.000%    3.97ms
 99.000%   43.29ms
 99.900%   44.10ms
 99.990%   47.29ms
 99.999%   47.29ms
100.000%   47.29ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.280     0.000000            1         1.00
       0.547     0.100000          300         1.11
       0.676     0.200000          602         1.25
       0.816     0.300000          901         1.43
       0.937     0.400000         1201         1.67
       1.047     0.500000         1500         2.00
       1.096     0.550000         1649         2.22
       1.137     0.600000         1802         2.50
       1.190     0.650000         1949         2.86
       1.237     0.700000         2099         3.33
       1.287     0.750000         2250         4.00
       1.312     0.775000         2327         4.44
       1.338     0.800000         2402         5.00
       1.365     0.825000         2476         5.71
       1.400     0.850000         2550         6.67
       1.449     0.875000         2625         8.00
       1.499     0.887500         2662         8.89
       3.971     0.900000         2699        10.00
       4.771     0.912500         2736        11.43
      17.087     0.925000         2777        13.33
      17.855     0.937500         2811        16.00
      17.967     0.943750         2832        17.78
      30.175     0.950000         2851        20.00
      30.223     0.956250         2867        22.86
      30.271     0.962500         2886        26.67
      31.023     0.968750         2906        32.00
      31.071     0.971875         2914        35.56
      43.263     0.975000         2954        40.00
      43.263     0.978125         2954        45.71
      43.263     0.981250         2954        53.33
      43.263     0.984375         2954        64.00
      43.295     0.985938         2972        71.11
      43.295     0.987500         2972        80.00
      43.295     0.989062         2972        91.43
      43.295     0.990625         2972       106.67
      44.063     0.992188         2983       128.00
      44.063     0.992969         2983       142.22
      44.063     0.993750         2983       160.00
      44.063     0.994531         2983       182.86
      44.095     0.995313         2996       213.33
      44.095     0.996094         2996       256.00
      44.095     0.996484         2996       284.44
      44.095     0.996875         2996       320.00
      44.095     0.997266         2996       365.71
      44.095     0.997656         2996       426.67
      44.095     0.998047         2996       512.00
      44.095     0.998242         2996       568.89
      44.095     0.998437         2996       640.00
      44.095     0.998633         2996       731.43
      44.095     0.998828         2996       853.33
      44.095     0.999023         2996      1024.00
      44.095     0.999121         2996      1137.78
      44.095     0.999219         2996      1280.00
      44.095     0.999316         2996      1462.86
      47.263     0.999414         2997      1706.67
      47.263     0.999512         2997      2048.00
      47.263     0.999561         2997      2275.56
      47.263     0.999609         2997      2560.00
      47.263     0.999658         2997      2925.71
      47.295     0.999707         2998      3413.33
      47.295     1.000000         2998          inf
#[Mean    =        3.447, StdDeviation   =        8.623]
#[Max     =       47.264, Total count    =         2998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  208.00us
 75.000%  238.00us
 90.000%  267.00us
 99.000%   42.85ms
 99.900%   43.90ms
 99.990%   46.81ms
 99.999%   46.81ms
100.000%   46.81ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.125     0.000000            1         1.00
       0.172     0.100000          317         1.11
       0.183     0.200000          610         1.25
       0.192     0.300000          922         1.43
       0.200     0.400000         1205         1.67
       0.208     0.500000         1508         2.00
       0.213     0.550000         1662         2.22
       0.219     0.600000         1815         2.50
       0.224     0.650000         1970         2.86
       0.231     0.700000         2120         3.33
       0.238     0.750000         2257         4.00
       0.241     0.775000         2334         4.44
       0.245     0.800000         2399         5.00
       0.250     0.825000         2476         5.71
       0.255     0.850000         2564         6.67
       0.260     0.875000         2628         8.00
       0.264     0.887500         2667         8.89
       0.267     0.900000         2704        10.00
       0.272     0.912500         2744        11.43
       0.276     0.925000         2779        13.33
       0.282     0.937500         2817        16.00
       0.284     0.943750         2830        17.78
       0.288     0.950000         2853        20.00
       0.291     0.956250         2870        22.86
       0.298     0.962500         2890        26.67
       0.307     0.968750         2906        32.00
       0.318     0.971875         2914        35.56
      42.655     0.975000         2927        40.00
      42.687     0.978125         2936        45.71
      42.751     0.981250         2946        53.33
      42.783     0.984375         2953        64.00
      42.815     0.985938         2959        71.11
      42.847     0.987500         2968        80.00
      42.847     0.989062         2968        91.43
      42.879     0.990625         2972       106.67
      42.911     0.992188         2981       128.00
      42.911     0.992969         2981       142.22
      42.911     0.993750         2981       160.00
      43.775     0.994531         2984       182.86
      43.775     0.995313         2984       213.33
      43.807     0.996094         2987       256.00
      43.839     0.996484         2991       284.44
      43.839     0.996875         2991       320.00
      43.839     0.997266         2991       365.71
      43.839     0.997656         2991       426.67
      43.871     0.998047         2994       512.00
      43.871     0.998242         2994       568.89
      43.871     0.998437         2994       640.00
      43.871     0.998633         2994       731.43
      43.903     0.998828         2996       853.33
      43.903     0.999023         2996      1024.00
      43.903     0.999121         2996      1137.78
      43.903     0.999219         2996      1280.00
      43.903     0.999316         2996      1462.86
      46.783     0.999414         2997      1706.67
      46.783     0.999512         2997      2048.00
      46.783     0.999561         2997      2275.56
      46.783     0.999609         2997      2560.00
      46.783     0.999658         2997      2925.71
      46.815     0.999707         2998      3413.33
      46.815     1.000000         2998          inf
#[Mean    =        1.369, StdDeviation   =        6.947]
#[Max     =       46.784, Total count    =         2998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4502 requests in 30.00s, 716.63KB read
Requests/sec:    150.06
Transfer/sec:     23.89KB